Ran Plan for dir: `src/backend/infrastructure` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/atlantis-data/bin/terraform1.12.2 plan -input=false -refresh -no-color -out \"/atlantis-data/repos/yagavrin/devops-diplom/2/default/src/backend/infrastructure/devops-diplom-default.tfplan\"" in "/atlantis-data/repos/yagavrin/devops-diplom/2/default/src/backend/infrastructure": exit status 1
data.yandex_compute_image.manager_image: Reading...
data.yandex_compute_image.worker_image: Reading...
data.yandex_compute_image.atlantis_image: Reading...
yandex_vpc_network.dev_vpc: Refreshing state... [id=enp271du6h2054ovgdhm]
yandex_container_registry.container_registry: Refreshing state... [id=crpiop5kci1440r661pk]
yandex_iam_service_account.ccm_ca: Refreshing state... [id=aje1moe844kbacam7jou]
data.yandex_compute_image.atlantis_image: Read complete after 0s [id=fd8tintsvhoqfedvac5h]
yandex_resourcemanager_folder_iam_member.ccm_vpc_admin: Refreshing state... [id=b1g27qj7at5k60ueun5j/vpc.publicAdmin/serviceAccount:aje1moe844kbacam7jou]
yandex_resourcemanager_folder_iam_member.ccm_lb_admin: Refreshing state... [id=b1g27qj7at5k60ueun5j/load-balancer.admin/serviceAccount:aje1moe844kbacam7jou]
data.yandex_compute_image.worker_image: Read complete after 0s [id=fd8tintsvhoqfedvac5h]
yandex_iam_service_account_key.ccm_key: Refreshing state... [id=aje5ap8mmdeqtqo81p87]
data.yandex_compute_image.manager_image: Read complete after 0s [id=fd8tintsvhoqfedvac5h]
local_file.ccm_key_file: Refreshing state... [id=e283cae7629dafb8f449a864bce09a90d888d42f]
yandex_vpc_subnet.private_subnets["2"]: Refreshing state... [id=fl8frv2j2mgqep1tgpf8]
yandex_vpc_subnet.private_subnets["1"]: Refreshing state... [id=e2l8u5ph7t55hrt215ek]
yandex_vpc_subnet.private_subnets["0"]: Refreshing state... [id=e9b4dcb5v99aim4uj3q4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # local_file.ccm_key_file will be created
  + resource "local_file" "ccm_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./sa-key.json"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Error: Invalid function argument

  on locals.tf line 2, in locals:
   2:   vms_metadata = { ssh-keys = "${var.vm_user}:${file(var.ssh_pub_key_path)}" }
    ├────────────────
    │ while calling file(path)
    │ var.ssh_pub_key_path is "~/.ssh/nt_test.pub"

Invalid value for "path" parameter: no file exists at "~/.ssh/nt_test.pub";
this function works only with files that are distributed as part of the
configuration source code, so if this file will be created by a resource in
this configuration you must instead obtain this result from an attribute of
that resource.

```
</details>

